Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano_water_tolerance/firmware/src/packs/PIC32CM6408PL10048_DFP/component/dsu.h
#define DSU_WPCTRL_WPEN_Pos                   _UINT32_(0)                                          /* (DSU_WPCTRL) Write Protection Enable Position */
#define DSU_WPCTRL_WPEN_Msk                   (_UINT32_(0x1) << DSU_WPCTRL_WPEN_Pos)               /* (DSU_WPCTRL) Write Protection Enable Mask */
#define DSU_WPCTRL_WPEN(value)                (DSU_WPCTRL_WPEN_Msk & (_UINT32_(value) << DSU_WPCTRL_WPEN_Pos)) /* Assignment of value for WPEN in the DSU_WPCTRL register */
#define DSU_WPCTRL_WPLCK_Pos                  _UINT32_(1)                                          /* (DSU_WPCTRL) Write Protection Lock Position */
#define DSU_WPCTRL_WPLCK_Msk                  (_UINT32_(0x1) << DSU_WPCTRL_WPLCK_Pos)              /* (DSU_WPCTRL) Write Protection Lock Mask */
#define DSU_WPCTRL_WPLCK(value)               (DSU_WPCTRL_WPLCK_Msk & (_UINT32_(value) << DSU_WPCTRL_WPLCK_Pos)) /* Assignment of value for WPLCK in the DSU_WPCTRL register */
#define DSU_WPCTRL_WPKEY_Pos                  _UINT32_(8)                                          /* (DSU_WPCTRL) Write Protection Key Position */
#define DSU_WPCTRL_WPKEY_Msk                  (_UINT32_(0xFFFFFF) << DSU_WPCTRL_WPKEY_Pos)         /* (DSU_WPCTRL) Write Protection Key Mask */
#define DSU_WPCTRL_WPKEY(value)               (DSU_WPCTRL_WPKEY_Msk & (_UINT32_(value) << DSU_WPCTRL_WPKEY_Pos)) /* Assignment of value for WPKEY in the DSU_WPCTRL register */
#define   DSU_WPCTRL_WPKEY_KEY_Val            _UINT32_(0x445355)                                   /* (DSU_WPCTRL) Allow writes to the WPCTRL register  */
#define DSU_WPCTRL_WPKEY_KEY                  (DSU_WPCTRL_WPKEY_KEY_Val << DSU_WPCTRL_WPKEY_Pos)   /* (DSU_WPCTRL) Allow writes to the WPCTRL register Position */
#define DSU_WPCTRL_Msk                        _UINT32_(0xFFFFFF03)                                 /* (DSU_WPCTRL) Register Mask  */


/* -------- DSU_CTRLC : (DSU Offset: 0x100) (R/W 32) Control C -------- */
#define DSU_CTRLC_RESETVALUE                  _UINT32_(0x00)                                       /*  (DSU_CTRLC) Control C  Reset Value */

#define DSU_CTRLC_DBGRW0_Pos                  _UINT32_(0)                                          /* (DSU_CTRLC) CPU0 Debug R/W Position */
#define DSU_CTRLC_DBGRW0_Msk                  (_UINT32_(0x1) << DSU_CTRLC_DBGRW0_Pos)              /* (DSU_CTRLC) CPU0 Debug R/W Mask */
#define DSU_CTRLC_DBGRW0(value)               (DSU_CTRLC_DBGRW0_Msk & (_UINT32_(value) << DSU_CTRLC_DBGRW0_Pos)) /* Assignment of value for DBGRW0 in the DSU_CTRLC register */
#define DSU_CTRLC_Msk                         _UINT32_(0x00000001)                                 /* (DSU_CTRLC) Register Mask  */

#define DSU_CTRLC_DBGRW_Pos                   _UINT32_(0)                                          /* (DSU_CTRLC Position) CPUx Debug R/W */
#define DSU_CTRLC_DBGRW_Msk                   (_UINT32_(0x1) << DSU_CTRLC_DBGRW_Pos)               /* (DSU_CTRLC Mask) DBGRW */
#define DSU_CTRLC_DBGRW(value)                (DSU_CTRLC_DBGRW_Msk & (_UINT32_(value) << DSU_CTRLC_DBGRW_Pos)) 

/* -------- DSU_STATUSA : (DSU Offset: 0x104) ( R/ 32) Status A -------- */
#define DSU_STATUSA_RESETVALUE                _UINT32_(0x00)                                       /*  (DSU_STATUSA) Status A  Reset Value */

#define DSU_STATUSA_DONE_Pos                  _UINT32_(0)                                          /* (DSU_STATUSA) Done Status Position */
#define DSU_STATUSA_DONE_Msk                  (_UINT32_(0x1) << DSU_STATUSA_DONE_Pos)              /* (DSU_STATUSA) Done Status Mask */
#define DSU_STATUSA_DONE(value)               (DSU_STATUSA_DONE_Msk & (_UINT32_(value) << DSU_STATUSA_DONE_Pos)) /* Assignment of value for DONE in the DSU_STATUSA register */
#define DSU_STATUSA_CRSTEXT0_Pos              _UINT32_(8)                                          /* (DSU_STATUSA) CPU0 Reset Extension Status Position */
#define DSU_STATUSA_CRSTEXT0_Msk              (_UINT32_(0x1) << DSU_STATUSA_CRSTEXT0_Pos)          /* (DSU_STATUSA) CPU0 Reset Extension Status Mask */
#define DSU_STATUSA_CRSTEXT0(value)           (DSU_STATUSA_CRSTEXT0_Msk & (_UINT32_(value) << DSU_STATUSA_CRSTEXT0_Pos)) /* Assignment of value for CRSTEXT0 in the DSU_STATUSA register */
#define DSU_STATUSA_BREXT0_Pos                _UINT32_(16)                                         /* (DSU_STATUSA) Boot ROM 0 Phase Extension Status Position */
#define DSU_STATUSA_BREXT0_Msk                (_UINT32_(0x1) << DSU_STATUSA_BREXT0_Pos)            /* (DSU_STATUSA) Boot ROM 0 Phase Extension Status Mask */
#define DSU_STATUSA_BREXT0(value)             (DSU_STATUSA_BREXT0_Msk & (_UINT32_(value) << DSU_STATUSA_BREXT0_Pos)) /* Assignment of value for BREXT0 in the DSU_STATUSA register */
#define DSU_STATUSA_Msk                       _UINT32_(0x00010101)                                 /* (DSU_STATUSA) Register Mask  */

#define DSU_STATUSA_CRSTEXT_Pos               _UINT32_(8)                                          /* (DSU_STATUSA Position) CPUx Reset Extension Status */
#define DSU_STATUSA_CRSTEXT_Msk               (_UINT32_(0x1) << DSU_STATUSA_CRSTEXT_Pos)           /* (DSU_STATUSA Mask) CRSTEXT */
#define DSU_STATUSA_CRSTEXT(value)            (DSU_STATUSA_CRSTEXT_Msk & (_UINT32_(value) << DSU_STATUSA_CRSTEXT_Pos)) 
#define DSU_STATUSA_BREXT_Pos                 _UINT32_(16)                                         /* (DSU_STATUSA Position) Boot ROM x Phase Extension Status */
#define DSU_STATUSA_BREXT_Msk                 (_UINT32_(0x1) << DSU_STATUSA_BREXT_Pos)             /* (DSU_STATUSA Mask) BREXT */
#define DSU_STATUSA_BREXT(value)              (DSU_STATUSA_BREXT_Msk & (_UINT32_(value) << DSU_STATUSA_BREXT_Pos)) 

/* -------- DSU_STATUSB : (DSU Offset: 0x108) ( R/ 32) Status B -------- */
#define DSU_STATUSB_RESETVALUE                _UINT32_(0x00)                                       /*  (DSU_STATUSB) Status B  Reset Value */

#define DSU_STATUSB_BCCD0_Pos                 _UINT32_(0)                                          /* (DSU_STATUSB) Boot ROM Communication Channel 0 Dirty Position */
#define DSU_STATUSB_BCCD0_Msk                 (_UINT32_(0x1) << DSU_STATUSB_BCCD0_Pos)             /* (DSU_STATUSB) Boot ROM Communication Channel 0 Dirty Mask */
#define DSU_STATUSB_BCCD0(value)              (DSU_STATUSB_BCCD0_Msk & (_UINT32_(value) << DSU_STATUSB_BCCD0_Pos)) /* Assignment of value for BCCD0 in the DSU_STATUSB register */
#define DSU_STATUSB_BCCD1_Pos                 _UINT32_(1)                                          /* (DSU_STATUSB) Boot ROM Communication Channel 1 Dirty Position */
#define DSU_STATUSB_BCCD1_Msk                 (_UINT32_(0x1) << DSU_STATUSB_BCCD1_Pos)             /* (DSU_STATUSB) Boot ROM Communication Channel 1 Dirty Mask */
#define DSU_STATUSB_BCCD1(value)              (DSU_STATUSB_BCCD1_Msk & (_UINT32_(value) << DSU_STATUSB_BCCD1_Pos)) /* Assignment of value for BCCD1 in the DSU_STATUSB register */
#define DSU_STATUSB_DCCD0_Pos                 _UINT32_(2)                                          /* (DSU_STATUSB) Debug Communication Channel 0 Dirty Position */
#define DSU_STATUSB_DCCD0_Msk                 (_UINT32_(0x1) << DSU_STATUSB_DCCD0_Pos)             /* (DSU_STATUSB) Debug Communication Channel 0 Dirty Mask */
#define DSU_STATUSB_DCCD0(value)              (DSU_STATUSB_DCCD0_Msk & (_UINT32_(value) << DSU_STATUSB_DCCD0_Pos)) /* Assignment of value for DCCD0 in the DSU_STATUSB register */
#define DSU_STATUSB_DCCD1_Pos                 _UINT32_(3)                                          /* (DSU_STATUSB) Debug Communication Channel 1 Dirty Position */
#define DSU_STATUSB_DCCD1_Msk                 (_UINT32_(0x1) << DSU_STATUSB_DCCD1_Pos)             /* (DSU_STATUSB) Debug Communication Channel 1 Dirty Mask */
#define DSU_STATUSB_DCCD1(value)              (DSU_STATUSB_DCCD1_Msk & (_UINT32_(value) << DSU_STATUSB_DCCD1_Pos)) /* Assignment of value for DCCD1 in the DSU_STATUSB register */
#define DSU_STATUSB_DBGPRES_Pos               _UINT32_(8)                                          /* (DSU_STATUSB) Debugger Present Status Position */
#define DSU_STATUSB_DBGPRES_Msk               (_UINT32_(0x1) << DSU_STATUSB_DBGPRES_Pos)           /* (DSU_STATUSB) Debugger Present Status Mask */
#define DSU_STATUSB_DBGPRES(value)            (DSU_STATUSB_DBGPRES_Msk & (_UINT32_(value) << DSU_STATUSB_DBGPRES_Pos)) /* Assignment of value for DBGPRES in the DSU_STATUSB register */
#define DSU_STATUSB_HPS_Pos                   _UINT32_(10)                                         /* (DSU_STATUSB) Hot-plugging Status Position */
#define DSU_STATUSB_HPS_Msk                   (_UINT32_(0x1) << DSU_STATUSB_HPS_Pos)               /* (DSU_STATUSB) Hot-plugging Status Mask */
#define DSU_STATUSB_HPS(value)                (DSU_STATUSB_HPS_Msk & (_UINT32_(value) << DSU_STATUSB_HPS_Pos)) /* Assignment of value for HPS in the DSU_STATUSB register */
#define DSU_STATUSB_Msk                       _UINT32_(0x0000050F)                                 /* (DSU_STATUSB) Register Mask  */

#define DSU_STATUSB_BCCD_Pos                  _UINT32_(0)                                          /* (DSU_STATUSB Position) Boot ROM Communication Channel x Dirty */
#define DSU_STATUSB_BCCD_Msk                  (_UINT32_(0x3) << DSU_STATUSB_BCCD_Pos)              /* (DSU_STATUSB Mask) BCCD */
#define DSU_STATUSB_BCCD(value)               (DSU_STATUSB_BCCD_Msk & (_UINT32_(value) << DSU_STATUSB_BCCD_Pos)) 
#define DSU_STATUSB_DCCD_Pos                  _UINT32_(2)                                          /* (DSU_STATUSB Position) Debug Communication Channel x Dirty */
#define DSU_STATUSB_DCCD_Msk                  (_UINT32_(0x3) << DSU_STATUSB_DCCD_Pos)              /* (DSU_STATUSB Mask) DCCD */
#define DSU_STATUSB_DCCD(value)               (DSU_STATUSB_DCCD_Msk & (_UINT32_(value) << DSU_STATUSB_DCCD_Pos)) 

