Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano_water_tolerance/firmware/src/packs/PIC32CM6408PL10048_DFP/component/dsu.h
/* -------- DSU_ENTRY2 : (DSU Offset: 0x1008) ( R/ 32) CoreSight ROM Table Entry 2 -------- */
#define DSU_ENTRY2_EPRES_Pos                  _UINT32_(0)                                          /* (DSU_ENTRY2) CoreSight Entry Present Position */
#define DSU_ENTRY2_EPRES_Msk                  (_UINT32_(0x1) << DSU_ENTRY2_EPRES_Pos)              /* (DSU_ENTRY2) CoreSight Entry Present Mask */
#define DSU_ENTRY2_EPRES(value)               (DSU_ENTRY2_EPRES_Msk & (_UINT32_(value) << DSU_ENTRY2_EPRES_Pos)) /* Assignment of value for EPRES in the DSU_ENTRY2 register */
#define DSU_ENTRY2_FMT_Pos                    _UINT32_(1)                                          /* (DSU_ENTRY2) CoreSight Rom Table Format Position */
#define DSU_ENTRY2_FMT_Msk                    (_UINT32_(0x1) << DSU_ENTRY2_FMT_Pos)                /* (DSU_ENTRY2) CoreSight Rom Table Format Mask */
#define DSU_ENTRY2_FMT(value)                 (DSU_ENTRY2_FMT_Msk & (_UINT32_(value) << DSU_ENTRY2_FMT_Pos)) /* Assignment of value for FMT in the DSU_ENTRY2 register */
#define DSU_ENTRY2_ADDOFF_Pos                 _UINT32_(12)                                         /* (DSU_ENTRY2) CoreSight ROM Table Address Offset Position */
#define DSU_ENTRY2_ADDOFF_Msk                 (_UINT32_(0xFFFFF) << DSU_ENTRY2_ADDOFF_Pos)         /* (DSU_ENTRY2) CoreSight ROM Table Address Offset Mask */
#define DSU_ENTRY2_ADDOFF(value)              (DSU_ENTRY2_ADDOFF_Msk & (_UINT32_(value) << DSU_ENTRY2_ADDOFF_Pos)) /* Assignment of value for ADDOFF in the DSU_ENTRY2 register */
#define DSU_ENTRY2_Msk                        _UINT32_(0xFFFFF003)                                 /* (DSU_ENTRY2) Register Mask  */


/* -------- DSU_ENTRY3 : (DSU Offset: 0x100C) ( R/ 32) CoreSight ROM Table Entry 3 -------- */
#define DSU_ENTRY3_EPRES_Pos                  _UINT32_(0)                                          /* (DSU_ENTRY3) CoreSight Entry Present Position */
#define DSU_ENTRY3_EPRES_Msk                  (_UINT32_(0x1) << DSU_ENTRY3_EPRES_Pos)              /* (DSU_ENTRY3) CoreSight Entry Present Mask */
#define DSU_ENTRY3_EPRES(value)               (DSU_ENTRY3_EPRES_Msk & (_UINT32_(value) << DSU_ENTRY3_EPRES_Pos)) /* Assignment of value for EPRES in the DSU_ENTRY3 register */
#define DSU_ENTRY3_FMT_Pos                    _UINT32_(1)                                          /* (DSU_ENTRY3) CoreSight Rom Table Format Position */
#define DSU_ENTRY3_FMT_Msk                    (_UINT32_(0x1) << DSU_ENTRY3_FMT_Pos)                /* (DSU_ENTRY3) CoreSight Rom Table Format Mask */
#define DSU_ENTRY3_FMT(value)                 (DSU_ENTRY3_FMT_Msk & (_UINT32_(value) << DSU_ENTRY3_FMT_Pos)) /* Assignment of value for FMT in the DSU_ENTRY3 register */
#define DSU_ENTRY3_ADDOFF_Pos                 _UINT32_(12)                                         /* (DSU_ENTRY3) CoreSight ROM Table Address Offset Position */
#define DSU_ENTRY3_ADDOFF_Msk                 (_UINT32_(0xFFFFF) << DSU_ENTRY3_ADDOFF_Pos)         /* (DSU_ENTRY3) CoreSight ROM Table Address Offset Mask */
#define DSU_ENTRY3_ADDOFF(value)              (DSU_ENTRY3_ADDOFF_Msk & (_UINT32_(value) << DSU_ENTRY3_ADDOFF_Pos)) /* Assignment of value for ADDOFF in the DSU_ENTRY3 register */
#define DSU_ENTRY3_Msk                        _UINT32_(0xFFFFF003)                                 /* (DSU_ENTRY3) Register Mask  */


/* -------- DSU_MEMTYPE : (DSU Offset: 0x1FCC) ( R/ 32) CoreSight ROM Table Memory Type -------- */
#define DSU_MEMTYPE_RESETVALUE                _UINT32_(0x00)                                       /*  (DSU_MEMTYPE) CoreSight ROM Table Memory Type  Reset Value */

#define DSU_MEMTYPE_SYSMEM_Pos                _UINT32_(0)                                          /* (DSU_MEMTYPE) CoreSight System Memory Present Position */
#define DSU_MEMTYPE_SYSMEM_Msk                (_UINT32_(0x1) << DSU_MEMTYPE_SYSMEM_Pos)            /* (DSU_MEMTYPE) CoreSight System Memory Present Mask */
#define DSU_MEMTYPE_SYSMEM(value)             (DSU_MEMTYPE_SYSMEM_Msk & (_UINT32_(value) << DSU_MEMTYPE_SYSMEM_Pos)) /* Assignment of value for SYSMEM in the DSU_MEMTYPE register */
#define DSU_MEMTYPE_Msk                       _UINT32_(0x00000001)                                 /* (DSU_MEMTYPE) Register Mask  */


/* -------- DSU_PID4 : (DSU Offset: 0x1FD0) ( R/ 32) CoreSight Peripheral Identification 4 -------- */
#define DSU_PID4_RESETVALUE                   _UINT32_(0x00)                                       /*  (DSU_PID4) CoreSight Peripheral Identification 4  Reset Value */

#define DSU_PID4_DES2_Pos                     _UINT32_(0)                                          /* (DSU_PID4) CoreSight JEP-106 Continuation Code Position */
#define DSU_PID4_DES2_Msk                     (_UINT32_(0xF) << DSU_PID4_DES2_Pos)                 /* (DSU_PID4) CoreSight JEP-106 Continuation Code Mask */
#define DSU_PID4_DES2(value)                  (DSU_PID4_DES2_Msk & (_UINT32_(value) << DSU_PID4_DES2_Pos)) /* Assignment of value for DES2 in the DSU_PID4 register */
#define DSU_PID4_SIZE_Pos                     _UINT32_(4)                                          /* (DSU_PID4) CoreSight Size Position */
#define DSU_PID4_SIZE_Msk                     (_UINT32_(0xF) << DSU_PID4_SIZE_Pos)                 /* (DSU_PID4) CoreSight Size Mask */
#define DSU_PID4_SIZE(value)                  (DSU_PID4_SIZE_Msk & (_UINT32_(value) << DSU_PID4_SIZE_Pos)) /* Assignment of value for SIZE in the DSU_PID4 register */
#define DSU_PID4_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID4) Register Mask  */


/* -------- DSU_PID5 : (DSU Offset: 0x1FD4) ( R/ 32) CoreSight Peripheral Identification 5 -------- */
#define DSU_PID5_RESETVALUE                   _UINT32_(0x00)                                       /*  (DSU_PID5) CoreSight Peripheral Identification 5  Reset Value */

#define DSU_PID5_RES0_Pos                     _UINT32_(0)                                          /* (DSU_PID5) CoreSight Reserved Field Position */
#define DSU_PID5_RES0_Msk                     (_UINT32_(0xFF) << DSU_PID5_RES0_Pos)                /* (DSU_PID5) CoreSight Reserved Field Mask */
#define DSU_PID5_RES0(value)                  (DSU_PID5_RES0_Msk & (_UINT32_(value) << DSU_PID5_RES0_Pos)) /* Assignment of value for RES0 in the DSU_PID5 register */
#define DSU_PID5_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID5) Register Mask  */


/* -------- DSU_PID6 : (DSU Offset: 0x1FD8) ( R/ 32) CoreSight Peripheral Identification 6 -------- */
#define DSU_PID6_RESETVALUE                   _UINT32_(0x00)                                       /*  (DSU_PID6) CoreSight Peripheral Identification 6  Reset Value */

#define DSU_PID6_RES0_Pos                     _UINT32_(0)                                          /* (DSU_PID6) CoreSight Reserved Field Position */
#define DSU_PID6_RES0_Msk                     (_UINT32_(0xFF) << DSU_PID6_RES0_Pos)                /* (DSU_PID6) CoreSight Reserved Field Mask */
#define DSU_PID6_RES0(value)                  (DSU_PID6_RES0_Msk & (_UINT32_(value) << DSU_PID6_RES0_Pos)) /* Assignment of value for RES0 in the DSU_PID6 register */
#define DSU_PID6_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID6) Register Mask  */


/* -------- DSU_PID7 : (DSU Offset: 0x1FDC) ( R/ 32) CoreSight Peripheral Identification 7 -------- */
#define DSU_PID7_RESETVALUE                   _UINT32_(0x00)                                       /*  (DSU_PID7) CoreSight Peripheral Identification 7  Reset Value */

