Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano_water_tolerance/firmware/src/packs/PIC32CM6408PL10048_DFP/component/dsu.h
#define DSU_PID7_RES0_Pos                     _UINT32_(0)                                          /* (DSU_PID7) CoreSight Reserved Field Position */
#define DSU_PID7_RES0_Msk                     (_UINT32_(0xFF) << DSU_PID7_RES0_Pos)                /* (DSU_PID7) CoreSight Reserved Field Mask */
#define DSU_PID7_RES0(value)                  (DSU_PID7_RES0_Msk & (_UINT32_(value) << DSU_PID7_RES0_Pos)) /* Assignment of value for RES0 in the DSU_PID7 register */
#define DSU_PID7_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID7) Register Mask  */


/* -------- DSU_PID0 : (DSU Offset: 0x1FE0) ( R/ 32) CoreSight Peripheral Identification 0 -------- */
#define DSU_PID0_RESETVALUE                   _UINT32_(0xD0)                                       /*  (DSU_PID0) CoreSight Peripheral Identification 0  Reset Value */

#define DSU_PID0_PART0_Pos                    _UINT32_(0)                                          /* (DSU_PID0) CoreSight Part Number Bits Position */
#define DSU_PID0_PART0_Msk                    (_UINT32_(0xFF) << DSU_PID0_PART0_Pos)               /* (DSU_PID0) CoreSight Part Number Bits Mask */
#define DSU_PID0_PART0(value)                 (DSU_PID0_PART0_Msk & (_UINT32_(value) << DSU_PID0_PART0_Pos)) /* Assignment of value for PART0 in the DSU_PID0 register */
#define DSU_PID0_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID0) Register Mask  */


/* -------- DSU_PID1 : (DSU Offset: 0x1FE4) ( R/ 32) CoreSight Peripheral Identification 1 -------- */
#define DSU_PID1_RESETVALUE                   _UINT32_(0x9C)                                       /*  (DSU_PID1) CoreSight Peripheral Identification 1  Reset Value */

#define DSU_PID1_PART1_Pos                    _UINT32_(0)                                          /* (DSU_PID1) CoreSight Part Number Bits Position */
#define DSU_PID1_PART1_Msk                    (_UINT32_(0xF) << DSU_PID1_PART1_Pos)                /* (DSU_PID1) CoreSight Part Number Bits Mask */
#define DSU_PID1_PART1(value)                 (DSU_PID1_PART1_Msk & (_UINT32_(value) << DSU_PID1_PART1_Pos)) /* Assignment of value for PART1 in the DSU_PID1 register */
#define DSU_PID1_DES0_Pos                     _UINT32_(4)                                          /* (DSU_PID1) CoreSight JEP106 Identification Code Bits Position */
#define DSU_PID1_DES0_Msk                     (_UINT32_(0xF) << DSU_PID1_DES0_Pos)                 /* (DSU_PID1) CoreSight JEP106 Identification Code Bits Mask */
#define DSU_PID1_DES0(value)                  (DSU_PID1_DES0_Msk & (_UINT32_(value) << DSU_PID1_DES0_Pos)) /* Assignment of value for DES0 in the DSU_PID1 register */
#define DSU_PID1_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID1) Register Mask  */


/* -------- DSU_PID2 : (DSU Offset: 0x1FE8) ( R/ 32) CoreSight Peripheral Identification 2 -------- */
#define DSU_PID2_DES1_Pos                     _UINT32_(0)                                          /* (DSU_PID2) CoreSight JEP106 Identification Code Bits Position */
#define DSU_PID2_DES1_Msk                     (_UINT32_(0x7) << DSU_PID2_DES1_Pos)                 /* (DSU_PID2) CoreSight JEP106 Identification Code Bits Mask */
#define DSU_PID2_DES1(value)                  (DSU_PID2_DES1_Msk & (_UINT32_(value) << DSU_PID2_DES1_Pos)) /* Assignment of value for DES1 in the DSU_PID2 register */
#define DSU_PID2_JEDEC_Pos                    _UINT32_(3)                                          /* (DSU_PID2) CoreSight JEDEC Assignment Position */
#define DSU_PID2_JEDEC_Msk                    (_UINT32_(0x1) << DSU_PID2_JEDEC_Pos)                /* (DSU_PID2) CoreSight JEDEC Assignment Mask */
#define DSU_PID2_JEDEC(value)                 (DSU_PID2_JEDEC_Msk & (_UINT32_(value) << DSU_PID2_JEDEC_Pos)) /* Assignment of value for JEDEC in the DSU_PID2 register */
#define DSU_PID2_REVISION_Pos                 _UINT32_(4)                                          /* (DSU_PID2) CoreSight Revision Number Position */
#define DSU_PID2_REVISION_Msk                 (_UINT32_(0xF) << DSU_PID2_REVISION_Pos)             /* (DSU_PID2) CoreSight Revision Number Mask */
#define DSU_PID2_REVISION(value)              (DSU_PID2_REVISION_Msk & (_UINT32_(value) << DSU_PID2_REVISION_Pos)) /* Assignment of value for REVISION in the DSU_PID2 register */
#define DSU_PID2_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID2) Register Mask  */


/* -------- DSU_PID3 : (DSU Offset: 0x1FEC) ( R/ 32) CoreSight Peripheral Identification 3 -------- */
#define DSU_PID3_RESETVALUE                   _UINT32_(0x00)                                       /*  (DSU_PID3) CoreSight Peripheral Identification 3  Reset Value */

#define DSU_PID3_CMOD_Pos                     _UINT32_(0)                                          /* (DSU_PID3) CoreSight Custom Modifier 0 Position */
#define DSU_PID3_CMOD_Msk                     (_UINT32_(0xF) << DSU_PID3_CMOD_Pos)                 /* (DSU_PID3) CoreSight Custom Modifier 0 Mask */
#define DSU_PID3_CMOD(value)                  (DSU_PID3_CMOD_Msk & (_UINT32_(value) << DSU_PID3_CMOD_Pos)) /* Assignment of value for CMOD in the DSU_PID3 register */
#define DSU_PID3_REVAND_Pos                   _UINT32_(4)                                          /* (DSU_PID3) CoreSight REVAND Position */
#define DSU_PID3_REVAND_Msk                   (_UINT32_(0xF) << DSU_PID3_REVAND_Pos)               /* (DSU_PID3) CoreSight REVAND Mask */
#define DSU_PID3_REVAND(value)                (DSU_PID3_REVAND_Msk & (_UINT32_(value) << DSU_PID3_REVAND_Pos)) /* Assignment of value for REVAND in the DSU_PID3 register */
#define DSU_PID3_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID3) Register Mask  */


/* -------- DSU_CID0 : (DSU Offset: 0x1FF0) ( R/ 32) CoreSight Component Identification 0 -------- */
#define DSU_CID0_RESETVALUE                   _UINT32_(0x0D)                                       /*  (DSU_CID0) CoreSight Component Identification 0  Reset Value */

